#+title: Codes

** run
#+begin_src bash :session gcc14 :results output 
sbatch script.sh arrayAddition.out
#+end_src

#+RESULTS:
: Submitted batch job 1161323




** run
#+begin_src bash :session gcc14 :results output 
sbatch script.sh reduction.out
#+end_src

#+RESULTS:
: Submitted batch job 1161390



** run
#+begin_src bash :session gcc14 :results output 
sbatch script.sh firstprivate.out
#+end_src

#+RESULTS:
: Submitted batch job 1161390



** run
#+begin_src bash :session gcc14 :results output 
sbatch script.sh lastprivate.out
#+end_src

#+RESULTS:
: Submitted batch job 1161390



** run
#+begin_src bash :session gcc14 :results output 
sbatch script.sh private.out
#+end_src

#+RESULTS:
: Submitted batch job 1161390


** run
#+begin_src bash :session gcc14 :results output 
sbatch script.sh conditionalCompillation.out
#+end_src

#+RESULTS:
: Submitted batch job 1161390


** run
#+begin_src bash :session gcc14 :results output 
sbatch script.sh manualReduction.out
#+end_src

#+RESULTS:
: Submitted batch job 1161390


** run
#+begin_src bash :session gcc14 :results output 
sbatch script.sh manualReduction1.out
#+end_src

#+RESULTS:
: Submitted batch job 1161390


** run
#+begin_src bash :session gcc14 :results output 
sbatch script.sh barrier.out
#+end_src

#+RESULTS:
: Submitted batch job 1161390


** run
#+begin_src bash :session gcc14 :results output 
sbatch script.sh critical.out
#+end_src

#+RESULTS:
: Submitted batch job 1161390


** run
#+begin_src bash :session gcc14 :results output 
sbatch script.sh dynamic.out
#+end_src

#+RESULTS:
: Submitted batch job 1161390


** run
#+begin_src bash :session gcc14 :results output 
sbatch script.sh dynamic1.out
#+end_src

#+RESULTS:
: Submitted batch job 1161390


** run
#+begin_src bash :session gcc14 :results output 
sbatch script.sh matrixAddition.out
#+end_src

#+RESULTS:
: Submitted batch job 1161323




** run
#+begin_src bash :session gcc14 :results output 
sbatch script.sh atomic.out
#+end_src

#+RESULTS:
: Submitted batch job 1161323



** run
#+begin_src bash :session gcc14 :results output 
sbatch script.sh section.out
#+end_src

#+RESULTS:
: Submitted batch job 1161323



** run
#+begin_src bash :session gcc14 :results output 
sbatch script.sh taskParallelism.out
#+end_src

#+RESULTS:
: Submitted batch job 1161323


** run
#+begin_src bash :session gcc14 :results output 
sbatch script.sh taskParallelism1.out
#+end_src

#+RESULTS:
: Submitted batch job 1161323


* pi
#+begin_src C :tangle pi.c
#include<stdio.h>
#include<stdlib.h>
#include<math.h>
#include<sys/time.h>
#include<omp.h>

//#define N 9999999999

int main()
{
    long long i, N = 9999999999;
    double area, pi;
    double dx, y, x;
    double exe_time;
    struct timeval stop_time, start_time;

    dx = 1.0 / N;
    area = 0.0;

    gettimeofday(&start_time, NULL);

    //#pragma omp parallel for private(x, y) reduction(+:area) num_threads(20)
    for(i = 0; i < N; i++){
        x = i * dx;
        y = sqrt(1 - x*x);
        area += y * dx;
    }

    gettimeofday(&stop_time, NULL);

    exe_time = (stop_time.tv_sec + (stop_time.tv_usec / 1000000.0)) -
               (start_time.tv_sec + (start_time.tv_usec / 1000000.0));

    pi = 4.0 * area;

    printf("\n Value of pi is = %.16lf\n Execution time is = %lf seconds\n", pi, exe_time);

    return 0;
}

#+end_src

#+begin_src bash :session gcc14 :results output 
gcc -fopenmp -lm pi.c -o pi.out
#+end_src

#+RESULTS:

#+begin_src bash :session gcc14 :results output 
sbatch script.sh pi.out
#+end_src

#+RESULTS:
: Submitted batch job 1163755


* prime count serial
#+begin_src C :tangle primeCount.c
#include<stdio.h>
#include<stdlib.h>
#include<math.h>
#include<time.h>
#include<sys/time.h>

#define N 1000000
/*
                N  PRIME_NUMBER

                1           0
               10           4
              100          25
            1,000         168
           10,000       1,229
          100,000       9,592
        1,000,000      78,498
       10,000,000     664,579
      100,000,000   5,761,455
    1,000,000,000  50,847,534

*/

int main()
{
	int i, j;
	int count, flag;
	double exe_time;
	struct timeval stop_time, start_time;

	count = 1; // 2 is prime. Our loop starts from 3

	gettimeofday(&start_time, NULL);


	for(i=3;i<N;i++)
	{
	 	flag = 0;
		for(j=2;j<i;j++)
	    {
		    if((i%j) == 0)
		    {
			    flag = 1;
			    break;
		    }
	    }
        if(flag == 0)
        {
        	count++;
        }
	}

	gettimeofday(&stop_time, NULL);
	exe_time = (stop_time.tv_sec+(stop_time.tv_usec/1000000.0)) - (start_time.tv_sec+(start_time.tv_usec/1000000.0));

	printf("\n Number of prime numbers = %d \n Execution time is = %lf seconds\n", count, exe_time);

}

#+end_src

#+begin_src bash :session gcc14 :results output 
gcc -fopenmp -lm primeCount.c -o primeCount.out
#+end_src

#+RESULTS:

#+begin_src bash :session gcc14 :results output 
sbatch script.sh primeCount.out
#+end_src

#+RESULTS:
: Submitted batch job 1163793


* prime count parallel
#+begin_src C :tangle primeCount_parallel.c
#include<stdio.h>
#include<stdlib.h>
#include<math.h>
#include<time.h>
#include<sys/time.h>
#include<omp.h>

#define N 1000000

int main()
{
    int i, j;
    int count, flag;
    double exe_time;
    struct timeval stop_time, start_time;

    count = 1; // Counting '2' as prime

    gettimeofday(&start_time, NULL);

    #pragma omp parallel for private(j, flag) reduction(+:count) schedule(dynamic, 100)
    for(i = 3; i < N; i++)
    {
        flag = 0;
        for(j = 2; j*j <= i; j++)   // <-- Small optimization: Only check till sqrt(i)
        {
            if(i % j == 0)
            {
                flag = 1;
                break;
            }
        }
        if(flag == 0)
        {
            count++;
        }
    }

    gettimeofday(&stop_time, NULL);

    exe_time = (stop_time.tv_sec + (stop_time.tv_usec/1000000.0)) -
               (start_time.tv_sec + (start_time.tv_usec/1000000.0));

    printf("\n Number of prime numbers = %d", count);
    printf("\n Execution time is = %lf seconds\n", exe_time);

    return 0;
}

#+end_src

#+begin_src bash :session gcc14 :results output 
gcc -fopenmp -lm primeCount_parallel.c -o primeCount_parallel.out
#+end_src

#+RESULTS:

#+begin_src bash :session gcc14 :results output 
sbatch script.sh primeCount_parallel.out
#+end_src

#+RESULTS:
: Submitted batch job 1163799
